In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings("ignore")

In [41]:
df = pd.read_csv("C:\\Users\\GOURAV NEGI\\Downloads\\titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [42]:
df.shape

(891, 12)

In [43]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [44]:
df = df.drop('Name', axis=1)

In [45]:
df = df.drop('Cabin',axis=1)

In [46]:
df = df.drop('Ticket',axis=1)

In [47]:
df = df.drop('Fare',axis=1)

In [49]:
df = df.drop('SibSp',axis=1)

In [50]:
df = df.drop('Parch',axis=1)

In [51]:
df

     PassengerId  Survived  Pclass     Sex   Age Embarked
0              1         0       3    male  22.0        S
1              2         1       1  female  38.0        C
2              3         1       3  female  26.0        S
3              4         1       1  female  35.0        S
4              5         0       3    male  35.0        S
..           ...       ...     ...     ...   ...      ...
886          887         0       2    male  27.0        S
887          888         1       1  female  19.0        S
888          889         0       3  female   NaN        S
889          890         1       1    male  26.0        C
890          891         0       3    male  32.0        Q

[891 rows x 6 columns]

In [52]:
df.describe()

       PassengerId    Survived      Pclass         Age
count   891.000000  891.000000  891.000000  714.000000
mean    446.000000    0.383838    2.308642   29.699118
std     257.353842    0.486592    0.836071   14.526497
min       1.000000    0.000000    1.000000    0.420000
25%     223.500000    0.000000    2.000000   20.125000
50%     446.000000    0.000000    3.000000   28.000000
75%     668.500000    1.000000    3.000000   38.000000
max     891.000000    1.000000    3.000000   80.000000

In [53]:
df['Age'] = df["Age"].fillna(df["Age"].median())

In [54]:
df.describe()

       PassengerId    Survived      Pclass         Age
count   891.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642   29.361582
std     257.353842    0.486592    0.836071   13.019697
min       1.000000    0.000000    1.000000    0.420000
25%     223.500000    0.000000    2.000000   22.000000
50%     446.000000    0.000000    3.000000   28.000000
75%     668.500000    1.000000    3.000000   35.000000
max     891.000000    1.000000    3.000000   80.000000

# Algorithm

In [59]:
from sklearn.model_selection import train_test_split
from sklearn.neighbors import NearestNeighbors
from sklearn.neighbors import KNeighborsClassifier
from sklearn import metrics
from sklearn.metrics import accuracy_score

In [60]:
x = [['Age','Sex']]

In [61]:
y = ['Survived']

In [70]:
x = np.array(df.filter(['Pclass','Sex','Embarked','Age'],axis=1))
y = np.array(df.filter(['Survived'],axis=1))

In [71]:
x_train,x_test, y_train, y_test = train_test_split(x,y,test_size=0.3)

In [72]:
x_train,x_test, y_train, y_test = train_test_split(x_train,y_train, test_size=0.3)